IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC2_CFG_CONTROLSS_ADC2_CFG.xml
<module name="CONTROLSS_ADC2_CFG_CONTROLSS_ADC2_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_ADC2_CFG_ADCCTL1" acronym="CONTROLSS_ADC2_CFG_ADCCTL1" offset="0x0" width="16" description="">
		<bitfield id="ADCBSY" width="1" begin="13" end="13" resetval="0x0" description="ADC Busy. Set when ADC SOC is generated, cleared by hardware four ADC clocks after negative edge of S/H pulse. Used by the ADC state machine to determine if ADC is available to sample.    0  ADC is available to sample next channel   1  ADC is busy and cannot sample another channel" range="13" rwaccess="RO"/> 
		<bitfield id="ADCBSYCHN" width="4" begin="11" end="8" resetval="0x0" description="ADC Busy Channel. Set when an ADC Start of Conversion (SOC) is generated. When ADCBSY=0: holds the value of the last converted SOC When ADCBSY=1: reflects the SOC currently being processed   0h  SOC0 is currently processing or was last SOC converted   1h  SOC1 is currently processing or was last SOC converted   2h  SOC2 is currently processing or was last SOC converted   3h  SOC3 is currently processing or was last SOC converted   4h  SOC4 is currently processing or was last SOC converted   5h  SOC5 is currently processing or was last SOC converted   6h  SOC6 is currently processing or was last SOC converted   7h  SOC7 is currently processing or was last SOC converted   8h  SOC8 is currently processing or was last SOC converted   9h  SOC9 is currently processing or was last SOC converted   Ah  SOC10 is currently processing or was last SOC converted   Bh  SOC11 is currently processing or was last SOC converted   Ch  SOC12 is currently processing or was last SOC converted   Dh  SOC13 is currently processing or was last SOC converted   Eh  SOC14 is currently processing or was last SOC converted   Fh  SOC15 is currently processing or was last SOC converted" range="11 - 8" rwaccess="RO"/> 
		<bitfield id="ADCPWDNZ" width="1" begin="7" end="7" resetval="0x0" description="ADC Power Down (active low). This bit controls the power up and power down of all the analog circuitry inside the analog core.    0  All analog circuitry inside the core is powered down   1  All analog circuitry inside the core is powered up" range="7" rwaccess="RW"/> 
		<bitfield id="INTPULSEPOS" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt Pulse Position.    0  Interrupt  pulse generation occurs when ADC begins conversion (at the end of the acquisition window) plus a number of SYSCLK cycles as specified in the ADCINTCYCLE.OFFSET register.   1  Interrupt pulse generation occurs at the end of the conversion, 1 cycle prior to the ADC result latching into its result register" range="2" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCCTL2" acronym="CONTROLSS_ADC2_CFG_ADCCTL2" offset="0x2" width="16" description="">
		<bitfield id="SIGNALMODE" width="1" begin="7" end="7" resetval="0x0" description="SOC Signaling Mode. Selects the input mode of the converter. Use the AdcSetMode function to change the signal mode.   0  Single-ended   1  Differential" range="7" rwaccess="RW"/> 
		<bitfield id="RESOLUTION" width="1" begin="6" end="6" resetval="0x0" description="SOC Conversion Resolution. Selects the resolution of the converter. Use the AdcSetMode function to change the resolution.   0  12-bit resolution   1  16-bit resolution" range="6" rwaccess="RW"/> 
		<bitfield id="PRESCALE" width="4" begin="3" end="0" resetval="0x0" description="ADC Clock Prescaler.   0000  ADCCLK = Input Clock / 1.0   0001  Invalid   0010  ADCCLK = Input Clock / 2.0   0011  ADCCLK = Input Clock / 2.5   0100  ADCCLK = Input Clock / 3.0   0101  ADCCLK = Input Clock / 3.5   0110  ADCCLK = Input Clock / 4.0   0111  ADCCLK = Input Clock / 4.5   1000  ADCCLK = Input Clock / 5.0   1001  ADCCLK = Input Clock / 5.5   1010  ADCCLK = Input Clock / 6.0   1011  ADCCLK = Input Clock / 6.5   1100  ADCCLK = Input Clock / 7.0   1101  ADCCLK = Input Clock / 7.5   1110  ADCCLK = Input Clock / 8.0   1111  ADCCLK = Input Clock / 8.5" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCBURSTCTL" acronym="CONTROLSS_ADC2_CFG_ADCBURSTCTL" offset="0x4" width="16" description="">
		<bitfield id="BURSTEN" width="1" begin="15" end="15" resetval="0x0" description="SOC Burst Mode Enable. This bit enables the SOC Burst Mode of operation.    0  Burst mode is disabled.   1  Burst mode is enabled." range="15" rwaccess="RW"/> 
		<bitfield id="BURSTSIZE" width="4" begin="11" end="8" resetval="0x0" description="SOC Burst Size Select. This bit field determines how many SOCs are converted when a burst conversion sequence is started. The first SOC converted is defined by the round robin pointer, which is advanced as each SOC is converted.    0h  1 SOC converted   1h  2 SOCs converted   2h  3 SOCs converted   3h  4 SOCs converted   4h  5 SOCs converted   5h  6 SOCs converted   6h  7 SOCs converted   7h  8 SOCs converted   8h  9 SOCs converted   9h  10 SOCs converted   Ah  11 SOCs converted   Bh  12 SOCs converted   Ch  13 SOCs converted   Dh  14 SOCs converted   Eh  15 SOCs converted   Fh  16 SOCs converted" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="BURSTTRIGSEL" width="7" begin="6" end="0" resetval="0x0" description="SOC Burst Trigger Source Select. Configures which trigger will start a burst conversion sequence.   00h - 7Fh: See AM602 spec. for trigger defintion" range="6 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTFLG" acronym="CONTROLSS_ADC2_CFG_ADCINTFLG" offset="0x6" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.    0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated  If the ADC interrupt is placed in continue to interrupt mode (INTSELxNy register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="3" rwaccess="RO"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.    0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated  If the ADC interrupt is placed in continue to interrupt mode (INTSELxNy register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="2" rwaccess="RO"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.    0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated  If the ADC interrupt is placed in continue to interrupt mode (INTSELxNy register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="1" rwaccess="RO"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.    0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated  If the ADC interrupt is placed in continue to interrupt mode (INTSELxNy register) then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTFLGCLR" acronym="CONTROLSS_ADC2_CFG_ADCINTFLGCLR" offset="0x8" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT4 and ADCINT4RESULT flags in the ADCINTFLG register.  If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT3 and ADCINT3RESULT flags in the ADCINTFLG register.   If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT2 and ADCINT2RESULT flags in the ADCINTFLG register. . If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Flag Clear. Reads return 0.    0  No action   1  Clears ADCINT1 and ADCINT1RESULT flags in the ADCINTFLG register.  If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTOVF" acronym="CONTROLSS_ADC2_CFG_ADCINTOVF" offset="0xA" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="3" rwaccess="RO"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="2" rwaccess="RO"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="1" rwaccess="RO"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Overflow Flags  Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.    0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected.  The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTOVFCLR" acronym="CONTROLSS_ADC2_CFG_ADCINTOVFCLR" offset="0xC" width="16" description="">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Overflow Clear Bits    0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTSEL1N2" acronym="CONTROLSS_ADC2_CFG_ADCINTSEL1N2" offset="0xE" width="16" description="">
		<bitfield id="INT2CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT2 Continue to Interrupt Mode   0  No further ADCINT2 pulses are generated until ADCINT2 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="RW"/> 
		<bitfield id="INT2E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT2 Interrupt Enable   0  ADCINT2 is disabled   1  ADCINT2 is enabled" range="13" rwaccess="RW"/> 
		<bitfield id="INT2SEL" width="4" begin="11" end="8" resetval="0x0" description="ADCINT2 EOC Source Select   0h  EOC0 is trigger for ADCINT2   1h  EOC1 is trigger for ADCINT2   2h  EOC2 is trigger for ADCINT2   3h  EOC3 is trigger for ADCINT2   4h  EOC4 is trigger for ADCINT2   5h  EOC5 is trigger for ADCINT2   6h  EOC6 is trigger for ADCINT2   7h  EOC7 is trigger for ADCINT2   8h  EOC8 is trigger for ADCINT2   9h  EOC9 is trigger for ADCINT2   Ah  EOC10 is trigger for ADCINT2   Bh  EOC11 is trigger for ADCINT2   Ch  EOC12 is trigger for ADCINT2   Dh  EOC13 is trigger for ADCINT2   Eh  EOC14 is trigger for ADCINT2   Fh  EOC15 is trigger for ADCINT2" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="INT1CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT1 Continue to Interrupt Mode   0  No further ADCINT1 pulses are generated until ADCINT1 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="RW"/> 
		<bitfield id="INT1E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT1 Interrupt Enable   0  ADCINT1 is disabled   1  ADCINT1 is enabled" range="5" rwaccess="RW"/> 
		<bitfield id="INT1SEL" width="4" begin="3" end="0" resetval="0x0" description="ADCINT1 EOC Source Select   0h  EOC0 is trigger for ADCINT1   1h  EOC1 is trigger for ADCINT1   2h  EOC2 is trigger for ADCINT1   3h  EOC3 is trigger for ADCINT1   4h  EOC4 is trigger for ADCINT1   5h  EOC5 is trigger for ADCINT1   6h  EOC6 is trigger for ADCINT1   7h  EOC7 is trigger for ADCINT1   8h  EOC8 is trigger for ADCINT1   9h  EOC9 is trigger for ADCINT1   Ah  EOC10 is trigger for ADCINT1   Bh  EOC11 is trigger for ADCINT1   Ch  EOC12 is trigger for ADCINT1   Dh  EOC13 is trigger for ADCINT1   Eh  EOC14 is trigger for ADCINT1   Fh  EOC15 is trigger for ADCINT1" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTSEL3N4" acronym="CONTROLSS_ADC2_CFG_ADCINTSEL3N4" offset="0x10" width="16" description="">
		<bitfield id="INT4CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT4 Continue to Interrupt Mode   0  No further ADCINT4 pulses are generated until ADCINT4 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="RW"/> 
		<bitfield id="INT4E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT4 Interrupt Enable   0  ADCINT4 is disabled   1  ADCINT4 is enabled" range="13" rwaccess="RW"/> 
		<bitfield id="INT4SEL" width="4" begin="11" end="8" resetval="0x0" description="ADCINT4 EOC Source Select   0h  EOC0 is trigger for ADCINT4   1h  EOC1 is trigger for ADCINT4   2h  EOC2 is trigger for ADCINT4   3h  EOC3 is trigger for ADCINT4   4h  EOC4 is trigger for ADCINT4   5h  EOC5 is trigger for ADCINT4   6h  EOC6 is trigger for ADCINT4   7h  EOC7 is trigger for ADCINT4   8h  EOC8 is trigger for ADCINT4   9h  EOC9 is trigger for ADCINT4   Ah  EOC10 is trigger for ADCINT4   Bh  EOC11 is trigger for ADCINT4   Ch  EOC12 is trigger for ADCINT4   Dh  EOC13 is trigger for ADCINT4   Eh  EOC14 is trigger for ADCINT4   Fh  EOC15 is trigger for ADCINT4" range="11 - 8" rwaccess="RW"/> 
		<bitfield id="INT3CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT3 Continue to Interrupt Mode   0  No further ADCINT3 pulses are generated until ADCINT3 flag (in ADCINTFLG register) is cleared by user.   1  ADCINT3 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="RW"/> 
		<bitfield id="INT3E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT3 Interrupt Enable   0  ADCINT3 is disabled   1  ADCINT3 is enabled" range="5" rwaccess="RW"/> 
		<bitfield id="INT3SEL" width="4" begin="3" end="0" resetval="0x0" description="ADCINT3 EOC Source Select   0h  EOC0 is trigger for ADCINT3   1h  EOC1 is trigger for ADCINT3   2h  EOC2 is trigger for ADCINT3   3h  EOC3 is trigger for ADCINT3   4h  EOC4 is trigger for ADCINT3   5h  EOC5 is trigger for ADCINT3   6h  EOC6 is trigger for ADCINT3   7h  EOC7 is trigger for ADCINT3   8h  EOC8 is trigger for ADCINT3   9h  EOC9 is trigger for ADCINT3   Ah  EOC10 is trigger for ADCINT3   Bh  EOC11 is trigger for ADCINT3   Ch  EOC12 is trigger for ADCINT3   Dh  EOC13 is trigger for ADCINT3   Eh  EOC14 is trigger for ADCINT3   Fh  EOC15 is trigger for ADCINT3" range="3 - 0" rwaccess="RW"/>
	</register>
