IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC2_CFG_CONTROLSS_ADC2_CFG.xml
	<register id="CONTROLSS_ADC2_CFG_ADCSOCPRICTL" acronym="CONTROLSS_ADC2_CFG_ADCSOCPRICTL" offset="0x12" width="16" description="">
		<bitfield id="RRPOINTER" width="5" begin="9" end="5" resetval="0x16" description="Round Robin Pointer. Holds the value of the last converted round robin SOCx to be used by the round robin scheme to determine order of conversions.   00h  SOC0 was last round robin SOC to convert, SOC1 is highest round robin priority.   01h  SOC1 was last round robin SOC to convert, SOC2 is highest round robin priority.   02h  SOC2 was last round robin SOC to convert, SOC3 is highest round robin priority.   03h  SOC3 was last round robin SOC to convert, SOC4 is highest round robin priority.   04h  SOC4 was last round robin SOC to convert, SOC5 is highest round robin priority.   05h  SOC5 was last round robin SOC to convert, SOC6 is highest round robin priority.   06h  SOC6 was last round robin SOC to convert, SOC7 is highest round robin priority.   07h  SOC7 was last round robin SOC to convert, SOC8 is highest round robin priority.   08h  SOC8 was last round robin SOC to convert, SOC9 is highest round robin priority.   09h  SOC9 was last round robin SOC to convert, SOC10 is highest round robin priority.   0Ah  SOC10 was last round robin SOC to convert, SOC11 is highest round robin priority.   0Bh  SOC11 was last round robin SOC to convert, SOC12 is highest round robin priority.   0Ch  SOC12 was last round robin SOC to convert, SOC13 is highest round robin priority.   0Dh  SOC13 was last round robin SOC to convert, SOC14 is highest round robin priority.   0Eh  SOC14 was last round robin SOC to convert, SOC15 is highest round robin priority.   0Fh  SOC15 was last round robin SOC to convert, SOC0 is highest round robin priority.   10h  Reset value to indicate no SOC has been converted. SOC0 is highest round robin priority. Set to this value when the device is reset, when the ADCCTL1.RESET bit is set, or when the ADCSOCPRICTL register is written. In the latter case, if a conversion is currently in progress, it will complete and then the new priority will take effect. Others  Invalid value." range="9 - 5" rwaccess="RO"/> 
		<bitfield id="SOCPRIORITY" width="5" begin="4" end="0" resetval="0x0" description="SOC Priority Determines the cutoff point for priority mode and round robin arbitration for SOCx   00h  SOC priority is handled in round robin mode for all channels.   01h  SOC0 is high priority, rest of channels are in round robin mode.   02h  SOC0-SOC1 are high priority, SOC2-SOC15 are in round robin mode.   03h  SOC0-SOC2 are high priority, SOC3-SOC15 are in round robin mode.   04h  SOC0-SOC3 are high priority, SOC4-SOC15 are in round robin mode.   05h  SOC0-SOC4 are high priority, SOC5-SOC15 are in round robin mode.   06h  SOC0-SOC5 are high priority, SOC6-SOC15 are in round robin mode.   07h  SOC0-SOC6 are high priority, SOC7-SOC15 are in round robin mode.   08h  SOC0-SOC7 are high priority, SOC8-SOC15 are in round robin mode.   09h  SOC0-SOC8 are high priority, SOC9-SOC15 are in round robin mode.   0Ah  SOC0-SOC9 are high priority, SOC10-SOC15 are in round robin mode.   0Bh  SOC0-SOC10 are high priority, SOC11-SOC15 are in round robin mode.   0Ch  SOC0-SOC11 are high priority, SOC12-SOC15 are in round robin mode.   0Dh  SOC0-SOC12 are high priority, SOC13-SOC15 are in round robin mode.   0Eh  SOC0-SOC13 are high priority, SOC14-SOC15 are in round robin mode.   0Fh  SOC0-SOC14 are high priority, SOC15 is in round robin mode.   10h  All SOCs are in high priority mode, arbitrated by SOC number. Others  Invalid selection." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTSOCSEL1" acronym="CONTROLSS_ADC2_CFG_ADCINTSOCSEL1" offset="0x14" width="16" description="">
		<bitfield id="SOC7" width="2" begin="15" end="14" resetval="0x0" description="SOC7 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC7. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC7. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC7.   10  ADCINT2 will trigger SOC7.   11  Invalid selection." range="15 - 14" rwaccess="RW"/> 
		<bitfield id="SOC6" width="2" begin="13" end="12" resetval="0x0" description="SOC6 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC6. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC6. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC6.   10  ADCINT2 will trigger SOC6.   11  Invalid selection." range="13 - 12" rwaccess="RW"/> 
		<bitfield id="SOC5" width="2" begin="11" end="10" resetval="0x0" description="SOC5 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC5. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC5. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC5.   10  ADCINT2 will trigger SOC5.   11  Invalid selection." range="11 - 10" rwaccess="RW"/> 
		<bitfield id="SOC4" width="2" begin="9" end="8" resetval="0x0" description="SOC4 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC4. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC4. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC4.   10  ADCINT2 will trigger SOC4.   11  Invalid selection." range="9 - 8" rwaccess="RW"/> 
		<bitfield id="SOC3" width="2" begin="7" end="6" resetval="0x0" description="SOC3 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC3. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC3. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC3.   10  ADCINT2 will trigger SOC3.   11  Invalid selection." range="7 - 6" rwaccess="RW"/> 
		<bitfield id="SOC2" width="2" begin="5" end="4" resetval="0x0" description="SOC2 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC2. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC2. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC2.   10  ADCINT2 will trigger SOC2.   11  Invalid selection." range="5 - 4" rwaccess="RW"/> 
		<bitfield id="SOC1" width="2" begin="3" end="2" resetval="0x0" description="SOC1 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC1. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC1. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC1.   10  ADCINT2 will trigger SOC1.   11  Invalid selection." range="3 - 2" rwaccess="RW"/> 
		<bitfield id="SOC0" width="2" begin="1" end="0" resetval="0x0" description="SOC0 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC0. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC0. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC0.   10  ADCINT2 will trigger SOC0.   11  Invalid selection." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCINTSOCSEL2" acronym="CONTROLSS_ADC2_CFG_ADCINTSOCSEL2" offset="0x16" width="16" description="">
		<bitfield id="SOC15" width="2" begin="15" end="14" resetval="0x0" description="SOC15 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC15. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC15. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC15.   10  ADCINT2 will trigger SOC15.   11  Invalid selection." range="15 - 14" rwaccess="RW"/> 
		<bitfield id="SOC14" width="2" begin="13" end="12" resetval="0x0" description="SOC14 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC14. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC14. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC14.   10  ADCINT2 will trigger SOC14.   11  Invalid selection." range="13 - 12" rwaccess="RW"/> 
		<bitfield id="SOC13" width="2" begin="11" end="10" resetval="0x0" description="SOC13 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC13. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC13. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC13.   10  ADCINT2 will trigger SOC13.   11  Invalid selection." range="11 - 10" rwaccess="RW"/> 
		<bitfield id="SOC12" width="2" begin="9" end="8" resetval="0x0" description="SOC12 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC12. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC12. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC12.   10  ADCINT2 will trigger SOC12.   11  Invalid selection." range="9 - 8" rwaccess="RW"/> 
		<bitfield id="SOC11" width="2" begin="7" end="6" resetval="0x0" description="SOC11 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC11. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC11. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC11.   10  ADCINT2 will trigger SOC11.   11  Invalid selection." range="7 - 6" rwaccess="RW"/> 
		<bitfield id="SOC10" width="2" begin="5" end="4" resetval="0x0" description="SOC10 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC10. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC10. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC10.   10  ADCINT2 will trigger SOC10.   11  Invalid selection." range="5 - 4" rwaccess="RW"/> 
		<bitfield id="SOC9" width="2" begin="3" end="2" resetval="0x0" description="SOC9 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC9. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC9. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC9.   10  ADCINT2 will trigger SOC9.   11  Invalid selection." range="3 - 2" rwaccess="RW"/> 
		<bitfield id="SOC8" width="2" begin="1" end="0" resetval="0x0" description="SOC8 ADC Interrupt Trigger Select. Selects which, if any, ADCINT triggers SOC8. The trigger selected in this field is in addition to the TRIGSEL field in the ADCSOCxCTL register.   00  No ADCINT will trigger SOC8. TRIGSEL field alone determines SOC0 trigger.   01  ADCINT1 will trigger SOC8.   10  ADCINT2 will trigger SOC8.   11  Invalid selection." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCSOCFLG1" acronym="CONTROLSS_ADC2_CFG_ADCSOCFLG1" offset="0x18" width="16" description="">
		<bitfield id="SOC15" width="1" begin="15" end="15" resetval="0x0" description="SOC15 Start of Conversion Flag. Indicates the state of SOC15 conversions.    0  No sample pending for SOC15.   1  Trigger has been received and sample is pending for SOC15.  This bit will be automatically cleared when the SOC15 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="15" rwaccess="RO"/> 
		<bitfield id="SOC14" width="1" begin="14" end="14" resetval="0x0" description="SOC14 Start of Conversion Flag. Indicates the state of SOC14 conversions.    0  No sample pending for SOC14.   1  Trigger has been received and sample is pending for SOC14.  This bit will be automatically cleared when the SOC14 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="14" rwaccess="RO"/> 
		<bitfield id="SOC13" width="1" begin="13" end="13" resetval="0x0" description="SOC13 Start of Conversion Flag. Indicates the state of SOC13 conversions.    0  No sample pending for SOC13.   1  Trigger has been received and sample is pending for SOC13.  This bit will be automatically cleared when the SOC13 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="13" rwaccess="RO"/> 
		<bitfield id="SOC12" width="1" begin="12" end="12" resetval="0x0" description="SOC12 Start of Conversion Flag. Indicates the state of SOC12 conversions.    0  No sample pending for SOC12.   1  Trigger has been received and sample is pending for SOC12.  This bit will be automatically cleared when the SOC12 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="12" rwaccess="RO"/> 
		<bitfield id="SOC11" width="1" begin="11" end="11" resetval="0x0" description="SOC11 Start of Conversion Flag. Indicates the state of SOC11 conversions.    0  No sample pending for SOC11.   1  Trigger has been received and sample is pending for SOC11.  This bit will be automatically cleared when the SOC11 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="11" rwaccess="RO"/> 
		<bitfield id="SOC10" width="1" begin="10" end="10" resetval="0x0" description="SOC10 Start of Conversion Flag. Indicates the state of SOC10 conversions.    0  No sample pending for SOC10.   1  Trigger has been received and sample is pending for SOC10.  This bit will be automatically cleared when the SOC10 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="10" rwaccess="RO"/> 
		<bitfield id="SOC9" width="1" begin="9" end="9" resetval="0x0" description="SOC9 Start of Conversion Flag. Indicates the state of SOC9 conversions.    0  No sample pending for SOC9.   1  Trigger has been received and sample is pending for SOC9.  This bit will be automatically cleared when the SOC9 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="9" rwaccess="RO"/> 
		<bitfield id="SOC8" width="1" begin="8" end="8" resetval="0x0" description="SOC8 Start of Conversion Flag. Indicates the state of SOC8 conversions.    0  No sample pending for SOC8.   1  Trigger has been received and sample is pending for SOC8.  This bit will be automatically cleared when the SOC8 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="8" rwaccess="RO"/> 
		<bitfield id="SOC7" width="1" begin="7" end="7" resetval="0x0" description="SOC7 Start of Conversion Flag. Indicates the state of SOC7 conversions.    0  No sample pending for SOC7.   1  Trigger has been received and sample is pending for SOC7.  This bit will be automatically cleared when the SOC7 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="7" rwaccess="RO"/> 
		<bitfield id="SOC6" width="1" begin="6" end="6" resetval="0x0" description="SOC6 Start of Conversion Flag. Indicates the state of SOC6 conversions.    0  No sample pending for SOC6.   1  Trigger has been received and sample is pending for SOC6.  This bit will be automatically cleared when the SOC6 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="6" rwaccess="RO"/> 
		<bitfield id="SOC5" width="1" begin="5" end="5" resetval="0x0" description="SOC5 Start of Conversion Flag. Indicates the state of SOC5 conversions.    0  No sample pending for SOC5.   1  Trigger has been received and sample is pending for SOC5.  This bit will be automatically cleared when the SOC5 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="5" rwaccess="RO"/> 
		<bitfield id="SOC4" width="1" begin="4" end="4" resetval="0x0" description="SOC4 Start of Conversion Flag. Indicates the state of SOC4 conversions.    0  No sample pending for SOC4.   1  Trigger has been received and sample is pending for SOC4.  This bit will be automatically cleared when the SOC4 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="4" rwaccess="RO"/> 
		<bitfield id="SOC3" width="1" begin="3" end="3" resetval="0x0" description="SOC3 Start of Conversion Flag. Indicates the state of SOC3 conversions.    0  No sample pending for SOC3.   1  Trigger has been received and sample is pending for SOC3.  This bit will be automatically cleared when the SOC3 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="3" rwaccess="RO"/> 
		<bitfield id="SOC2" width="1" begin="2" end="2" resetval="0x0" description="SOC2 Start of Conversion Flag. Indicates the state of SOC2 conversions.    0  No sample pending for SOC2.   1  Trigger has been received and sample is pending for SOC2.  This bit will be automatically cleared when the SOC2 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="2" rwaccess="RO"/> 
		<bitfield id="SOC1" width="1" begin="1" end="1" resetval="0x0" description="SOC1 Start of Conversion Flag. Indicates the state of SOC1 conversions.    0  No sample pending for SOC1.   1  Trigger has been received and sample is pending for SOC1.  This bit will be automatically cleared when the SOC1 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="1" rwaccess="RO"/> 
		<bitfield id="SOC0" width="1" begin="0" end="0" resetval="0x0" description="SOC0 Start of Conversion Flag. Indicates the state of SOC0 conversions.    0  No sample pending for SOC0.   1  Trigger has been received and sample is pending for SOC0.  This bit will be automatically cleared when the SOC0 conversion is started. If contention exists where this bit receives both a request to set and a request to clear on the same cycle, regardless of the source of either, this bit will be set and the request to clear will be ignored. In this case the overflow bit in the ADCSOCOVF1 register will not be affected regardless of whether this bit was previously set or not." range="0" rwaccess="RO"/>
	</register>
