IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC2_CFG_CONTROLSS_ADC2_CFG.xml
	<register id="CONTROLSS_ADC2_CFG_ADCSOCOVF1" acronym="CONTROLSS_ADC2_CFG_ADCSOCOVF1" offset="0x1C" width="16" description="">
		<bitfield id="SOC15" width="1" begin="15" end="15" resetval="0x0" description="SOC15 Start of Conversion Overflow Flag. Indicates an SOC15 event was generated in hardware while an existing SOC15 event was already pending.    0  No SOC15 event overflow.   1  SOC15 event overflow.  An overflow condition does not stop SOC15 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="15" rwaccess="RO"/> 
		<bitfield id="SOC14" width="1" begin="14" end="14" resetval="0x0" description="SOC14 Start of Conversion Overflow Flag. Indicates an SOC14 event was generated in hardware while an existing SOC14 event was already pending.    0  No SOC14 event overflow.   1  SOC14 event overflow.  An overflow condition does not stop SOC14 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="14" rwaccess="RO"/> 
		<bitfield id="SOC13" width="1" begin="13" end="13" resetval="0x0" description="SOC13 Start of Conversion Overflow Flag. Indicates an SOC13 event was generated in hardware while an existing SOC13 event was already pending.    0  No SOC13 event overflow.   1  SOC13 event overflow.  An overflow condition does not stop SOC13 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="13" rwaccess="RO"/> 
		<bitfield id="SOC12" width="1" begin="12" end="12" resetval="0x0" description="SOC12 Start of Conversion Overflow Flag. Indicates an SOC12 event was generated in hardware while an existing SOC12 event was already pending.    0  No SOC12 event overflow.   1  SOC12 event overflow.  An overflow condition does not stop SOC12 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="12" rwaccess="RO"/> 
		<bitfield id="SOC11" width="1" begin="11" end="11" resetval="0x0" description="SOC11 Start of Conversion Overflow Flag. Indicates an SOC11 event was generated in hardware while an existing SOC11 event was already pending.    0  No SOC11 event overflow.   1  SOC11 event overflow.  An overflow condition does not stop SOC11 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="11" rwaccess="RO"/> 
		<bitfield id="SOC10" width="1" begin="10" end="10" resetval="0x0" description="SOC10 Start of Conversion Overflow Flag. Indicates an SOC10 event was generated in hardware while an existing SOC10 event was already pending.    0  No SOC10 event overflow.   1  SOC10 event overflow.  An overflow condition does not stop SOC10 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="10" rwaccess="RO"/> 
		<bitfield id="SOC9" width="1" begin="9" end="9" resetval="0x0" description="SOC9 Start of Conversion Overflow Flag. Indicates an SOC9 event was generated in hardware while an existing SOC9 event was already pending.    0  No SOC9 event overflow.   1  SOC9 event overflow.  An overflow condition does not stop SOC9 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="9" rwaccess="RO"/> 
		<bitfield id="SOC8" width="1" begin="8" end="8" resetval="0x0" description="SOC8 Start of Conversion Overflow Flag. Indicates an SOC8 event was generated in hardware while an existing SOC8 event was already pending.    0  No SOC8 event overflow.   1  SOC8 event overflow.  An overflow condition does not stop SOC8 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="8" rwaccess="RO"/> 
		<bitfield id="SOC7" width="1" begin="7" end="7" resetval="0x0" description="SOC7 Start of Conversion Overflow Flag. Indicates an SOC7 event was generated in hardware while an existing SOC7 event was already pending.    0  No SOC7 event overflow.   1  SOC7 event overflow.  An overflow condition does not stop SOC7 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="7" rwaccess="RO"/> 
		<bitfield id="SOC6" width="1" begin="6" end="6" resetval="0x0" description="SOC6 Start of Conversion Overflow Flag. Indicates an SOC6 event was generated in hardware while an existing SOC6 event was already pending.    0  No SOC6 event overflow.   1  SOC6 event overflow.  An overflow condition does not stop SOC6 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="6" rwaccess="RO"/> 
		<bitfield id="SOC5" width="1" begin="5" end="5" resetval="0x0" description="SOC5 Start of Conversion Overflow Flag. Indicates an SOC5 event was generated in hardware while an existing SOC5 event was already pending.    0  No SOC5 event overflow.   1  SOC5 event overflow.  An overflow condition does not stop SOC5 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="5" rwaccess="RO"/> 
		<bitfield id="SOC4" width="1" begin="4" end="4" resetval="0x0" description="SOC4 Start of Conversion Overflow Flag. Indicates an SOC4 event was generated in hardware while an existing SOC4 event was already pending.    0  No SOC4 event overflow.   1  SOC4 event overflow.  An overflow condition does not stop SOC4 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="4" rwaccess="RO"/> 
		<bitfield id="SOC3" width="1" begin="3" end="3" resetval="0x0" description="SOC3 Start of Conversion Overflow Flag. Indicates an SOC3 event was generated in hardware while an existing SOC3 event was already pending.    0  No SOC3 event overflow.   1  SOC3 event overflow.  An overflow condition does not stop SOC3 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="3" rwaccess="RO"/> 
		<bitfield id="SOC2" width="1" begin="2" end="2" resetval="0x0" description="SOC2 Start of Conversion Overflow Flag. Indicates an SOC2 event was generated in hardware while an existing SOC2 event was already pending.    0  No SOC2 event overflow.   1  SOC2 event overflow.  An overflow condition does not stop SOC2 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="2" rwaccess="RO"/> 
		<bitfield id="SOC1" width="1" begin="1" end="1" resetval="0x0" description="SOC1 Start of Conversion Overflow Flag. Indicates an SOC1 event was generated in hardware while an existing SOC1 event was already pending.    0  No SOC1 event overflow.   1  SOC1 event overflow.  An overflow condition does not stop SOC1 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="1" rwaccess="RO"/> 
		<bitfield id="SOC0" width="1" begin="0" end="0" resetval="0x0" description="SOC0 Start of Conversion Overflow Flag. Indicates an SOC0 event was generated in hardware while an existing SOC0 event was already pending.    0  No SOC0 event overflow.   1  SOC0 event overflow.  An overflow condition does not stop SOC0 events from being processed. It simply is an indication that a hardware trigger was missed. A write to the ADCSOCFRC1 register does not affect this bit." range="0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCSOCOVFCLR1" acronym="CONTROLSS_ADC2_CFG_ADCSOCOVFCLR1" offset="0x1E" width="16" description="">
		<bitfield id="SOC15" width="1" begin="15" end="15" resetval="0x0" description="SOC15 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC15 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC15 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="15" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC14" width="1" begin="14" end="14" resetval="0x0" description="SOC14 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC14 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC14 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="14" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC13" width="1" begin="13" end="13" resetval="0x0" description="SOC13 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC13 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC13 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="13" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC12" width="1" begin="12" end="12" resetval="0x0" description="SOC12 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC12 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC12 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="12" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC11" width="1" begin="11" end="11" resetval="0x0" description="SOC11 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC11 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC11 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="11" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC10" width="1" begin="10" end="10" resetval="0x0" description="SOC10 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC10 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC10 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="10" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC9" width="1" begin="9" end="9" resetval="0x0" description="SOC9 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC9 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC9 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="9" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC8" width="1" begin="8" end="8" resetval="0x0" description="SOC8 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC8 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC8 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="8" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC7" width="1" begin="7" end="7" resetval="0x0" description="SOC7 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC7 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC7 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="7" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC6" width="1" begin="6" end="6" resetval="0x0" description="SOC6 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC6 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC6 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="6" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC5" width="1" begin="5" end="5" resetval="0x0" description="SOC5 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC5 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC5 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="5" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC4" width="1" begin="4" end="4" resetval="0x0" description="SOC4 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC4 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC4 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="4" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC3" width="1" begin="3" end="3" resetval="0x0" description="SOC3 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC3 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC3 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="3" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC2" width="1" begin="2" end="2" resetval="0x0" description="SOC2 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC2 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC2 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="2" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC1" width="1" begin="1" end="1" resetval="0x0" description="SOC1 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC1 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC1 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="1" rwaccess="RW
	  			 RRETURNS0S"/> 
		<bitfield id="SOC0" width="1" begin="0" end="0" resetval="0x0" description="SOC0 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC0 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.    0  No action.   1  Clear SOC0 overflow flag.  If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="0" rwaccess="RW
	  			 RRETURNS0S"/>
	</register>
