IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC2_CFG_CONTROLSS_ADC2_CFG.xml
	<register id="CONTROLSS_ADC2_CFG_ADCPPB2OFFCAL" acronym="CONTROLSS_ADC2_CFG_ADCPPB2OFFCAL" offset="0x94" width="16" description="">
		<bitfield id="OFFCAL" width="10" begin="9" end="0" resetval="0x0" description="ADC Post Processing Block 2 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 10-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register.    000h  No change. The ADC output is stored directly into ADCRESULT.   001h  ADC output - 1 is stored into ADCRESULT.   002h  ADC output - 2 is stored into ADCRESULT.   ...   200h  ADC output + 512 is stored into ADCRESULT.   ...   3FFh  ADC output + 1 is stored into ADCRESULT.  NOTE: In 16-bit mode, the subtraction will saturate at 0000h and FFFFh before being stored into the ADCRESULT register. In 12-bit mode, the subtraction will saturate at 0000h and 0FFFh before being stored into the ADCRESULT register." range="9 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCPPB2OFFREF" acronym="CONTROLSS_ADC2_CFG_ADCPPB2OFFREF" offset="0x96" width="16" description="">
		<bitfield id="OFFREF" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 2 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 16-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB2RESULT register. This subtraction is not saturated.    0000h  No change. The ADCRESULT value is passed on.   0001h  ADCRESULT - 1 is passed on.   0002h  ADCRESULT - 2 is passed on.   ...   8000h  ADCRESULT - 32,768 is passed on.   ...   FFFFh  ADCRESULT - 65,535 is passed on.  NOTE: In 12-bit mode the size of this register does not change from 16-bits. It is the user's responsibility to ensure that only a 12-bit value is written to this register when in 12-bit mode." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCPPB2TRIPHI" acronym="CONTROLSS_ADC2_CFG_ADCPPB2TRIPHI" offset="0x98" width="32" description="">
		<bitfield id="HSIGN" width="1" begin="16" end="16" resetval="0x0" description="High Limit Sign Bit. This is the sign bit (17th bit) to the LIMITHI bit field when in 16-bit ADC mode." range="16" rwaccess="RW"/> 
		<bitfield id="LIMITHI" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 2 Trip High Limit. This value sets the digital comparator trip high limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB2RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRESULT bit field of the ADCPPB2RESULT register." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCPPB2TRIPLO" acronym="CONTROLSS_ADC2_CFG_ADCPPB2TRIPLO" offset="0x9C" width="32" description="">
		<bitfield id="REQSTAMP" width="12" begin="31" end="20" resetval="0x0" description="ADC Post Processing Block 2 Request Time Stamp. When a trigger sets the associated SOC flag in the ADCSOCFLG1 register the value of ADCCOUNTER.FREECOUNT is loaded into this bit field." range="31 - 20" rwaccess="RO"/> 
		<bitfield id="LSIGN" width="1" begin="16" end="16" resetval="0x0" description="Low Limit Sign Bit. This is the sign bit (17th bit) to the LIMITLO bit field when in 16-bit ADC mode." range="16" rwaccess="RW"/> 
		<bitfield id="LIMITLO" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 2 Trip Low Limit. This value sets the digital comparator trip low limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB2RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRSULT bit field of the ADCPPB2RESULT register." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCPPB3CONFIG" acronym="CONTROLSS_ADC2_CFG_ADCPPB3CONFIG" offset="0xA0" width="16" description="">
		<bitfield id="CBCEN" width="1" begin="5" end="5" resetval="0x0" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." range="5" rwaccess="RW"/> 
		<bitfield id="TWOSCOMPEN" width="1" begin="4" end="4" resetval="0x0" description="ADC Post Processing Block 3 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB3RESULT register.    0  ADCPPB3RESULT = ADCRESULTx - ADCPPB3OFFREF   1  ADCPPB3RESULT = ADCPPB3OFFREF - ADCRESULTx" range="4" rwaccess="RW"/> 
		<bitfield id="CONFIG" width="4" begin="3" end="0" resetval="0x0" description="ADC Post Processing Block 3 Configuration. This bit field defines which SOC/EOC/RESULT is assocatied with this post processing block.    0000  SOC0/EOC0/RESULT0 is associated with post processing block 3   0001  SOC1/EOC1/RESULT1 is associated with post processing block 3   0010  SOC2/EOC2/RESULT2 is associated with post processing block 3   0011  SOC3/EOC3/RESULT3 is associated with post processing block 3   0100  SOC4/EOC4/RESULT4 is associated with post processing block 3   0101  SOC5/EOC5/RESULT5 is associated with post processing block 3   0110  SOC6/EOC6/RESULT6 is associated with post processing block 3   0111  SOC7/EOC7/RESULT7 is associated with post processing block 3   1000  SOC8/EOC8/RESULT8 is associated with post processing block 3   1001  SOC9/EOC9/RESULT9 is associated with post processing block 3   1010  SOC10/EOC10/RESULT10 is associated with post processing block 3   1011  SOC11/EOC11/RESULT11 is associated with post processing block 3   1100  SOC12/EOC12/RESULT12 is associated with post processing block 3   1101  SOC13/EOC13/RESULT13 is associated with post processing block 3   1110  SOC14/EOC14/RESULT14 is associated with post processing block 3   1111  SOC15/EOC15/RESULT15 is associated with post processing block 3" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ADC2_CFG_ADCPPB3STAMP" acronym="CONTROLSS_ADC2_CFG_ADCPPB3STAMP" offset="0xA2" width="16" description="">
		<bitfield id="DLYSTAMP" width="12" begin="11" end="0" resetval="0x0" description="ADC Post Processing Block 3 Delay Time Stamp. When an SOC starts sampling the value contained in REQSTAMP is subtracted from the value in ADCCOUNTER.FREECOUNT and loaded into this bit field, thereby giving the number of system clock cycles delay between the SOC trigger and the actual start of the sample." range="11 - 0" rwaccess="RO"/>
	</register>
